JMeter/2017-06-13_09-25-09.377691/cloud.yml
---
execution:
- concurrency: 500
  executor: jmeter
  hold-for: 25m
  locations:
    us-central1-a: 1
  ramp-up: 1m
  scenario: simple
local-bzt-version: 1.9.1
modules:
  gatling:
    properties:
      gatling.data.file.bufferSize: 256
  grinder:
    properties:
      grinder.useConsole: false
  jmeter:
    properties:
      jmeter.save.saveservice.autoflush: 'true'
      jmeter.save.saveservice.connect_time: 'true'
      jmeterengine.force.system.exit: 'true'
      mode: Stripped
      summariser.name: ''
scenarios:
  simple:
    data-sources: {}
    requests: []
    script: blazedemo_easy_peasy.jmx
services:
- local:
  - metrics:
    - cpu
    - mem
    - bytes-sent
    - bytes-recv
    - disk-read
    - disk-write
    - disk-space
    - engine-loop
    - conn-all
  module: monitoring
  run-at: local